// ОБРАБОТКАПРОВЕДЕНИЯ (Отказ, Режим)
// Новый релиз 

// Создание движений в регистре накопления ТоварныеЗапасы
Движения.ТоварныеЗапасы.Запись = Истина;
Для каждого ТекСтрокаТовары Из Товары Цикл

Движение = Движения.ТоварныеЗапасы.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.Товар = ТекСтрокаТовары.Товар;
Движение.Склад = Склад;
Движение.Количество = ТекСтрокаТовары.Количество;

КонецЦикла;

// Создание движения в регистре накопления Взаиморасчеты
Движения.Взаиморасчеты.Запись = Истина;
Движение = Движения.Взаиморасчеты.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.Контрагент = Поставщик;
Движение.Валюта = Валюта;
Движение.Договор = Договор;

Если Валюта.Пустая() Тогда

Движение.Сумма = Товары.Итог("Сумма");

Иначе

Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Курс;

Если Курс = 0 Тогда
Движение.Сумма = Товары.Итог("Сумма");
Иначе
Движение.Сумма = Товары.Итог("Сумма") / Курс;
КонецЕсли;

КонецЕсли;